Repository: Mai101o/ImageMeter-translations
Catalog: core/*.po
Languages: fa

# image-settings:canvas:color-scheme
source: Color scheme
fa: طرح رنگی

# image-settings:canvas:color-scheme:white
source: White
fa: سفید

# image-settings:canvas:color-scheme:black
source: Black
fa: سیاه

# image-settings:canvas:color-scheme:dark-blue
source: Dark blue
fa: آبی تیره

# image-settings:canvas:color-scheme:custom
source: Custom
fa: سفارشی

# image-settings:canvas:grid-subdivisions
source: Subdivisions
fa: زیرمجموعه

# templ:template-name:unnamed
source: New template
fa: الگوی جدید

# templ:custom:class-display-name
source: Custom template
fa: الگوی سفارشی

# templ:custom:new-template-name
source: New custom template
fa: الگوی سفارشی جدید

# templ:custom:column-content:empty
source: Empty
fa: خالی

# templ:custom:column-content:image-name
source: Image name
fa: نام عکس

# templ:custom:column-content:image-notes
source: Image notes
fa: یادداشت های عکس

# templ:custom:column-content:image-number
source: Image number
fa: شماره عکس

# templ:custom:column-content:image-capture-date
source: Image capture date
fa: تاریخ گرفتن عکس

# templ:custom:column-content:image-gps-latitude
source: Image GPS latitude
fa: عرض جغرافیایی GPS عکس

# templ:custom:column-content:image-gps-longitude
source: Image GPS longitude
fa: طول جغرافیایی GPS عکسS

# templ:custom:column-content:image-map-link
source: GPS map link
fa: لینک نقشه GPS

# templ:custom:column-type:text
source: Text note
fa: یادداشت متن

# templ:custom:new-tablespec-name
source: Custom Table
fa: جدول سفارشی

# templ:custom:new-tag
source: new tag
fa: برچسب جدید

# templ:custom:tag:filter:text
source: Text note
fa: یادداشت متن

# templ:custom:tag:filter:circle
source: Circle
fa: دایره

# templ:custom:tag:property-name
source: Tag
fa: برچسب

# templ:areasum:class-display-name
source: Area sum template
fa: الگوی مساحت سطح

# templ:areasum:preset:wallarea:display-name
source: Wall area
fa: سطح دیوار

# templ:areasum:preset:floorarea:display-name
source: Floor area
fa: سطح کف

# templ:areasum:tag:property-name
source: Tag
fa: برچسب

# templ:areasum:wallarea:new-template-name
source: New wall area template
fa: الگوی جدید سطح دیوار

# templ:areasum:floorarea:new-template-name
source: New floor area template
fa: الگوی سطح طبقه جدید

# templ:areasum:custom-add
source: custom (add)
fa: سفارشی (اضافه کردن)

# templ:areasum:custom-minus
source: custom (subtract)
fa: سفارشی (تفریق)

# templ:areasum:wallarea:wall
source: wall
fa: دیوار

# templ:areasum:wallarea:ceiling
source: ceiling
fa: سقف

# templ:areasum:wallarea:window
source: window
fa: پنجره

# templ:areasum:wallarea:door
source: door
fa: در

# templ:areasum:floorarea:living-room
source: living room
fa: هال

# templ:areasum:floorarea:bed-room
source: bed room
fa: اتاق خواب

# templ:areasum:floorarea:kitchen
source: kitchen
fa: آشپزخانه

# templ:areasum:floorarea:bath-room
source: bathroom
fa: حمام

# templ:areasum:floorarea:generic-room
source: other room
fa: اتاق دیگر

# templ:areasum:floorarea:balcony
source: balcony
fa: بالکن

# templ:areasum:table-column-header:item
source: Pos.
fa: پست.

# templ:areasum:table-column-header:description
source: Description
fa: توضیحات

# templ:areasum:table-column-header:count
source: Count
fa: شمردن

# templ:areasum:table-column-header:factor
source: Factor
fa: فاکتور

# templ:areasum:table-column-header:width
source: Width
fa: عرض

# templ:areasum:table-column-header:height
source: Height
fa: ارتفاع

# templ:areasum:table-column-header:area
source: Area
fa: سطح

# templ:areasum:table-column-header:deduction
source: Deduction
fa: کسر

# templ:areasum:table-column-header:sumarea
source: Sum
fa: مجموع

# templ:areasum:item
source: Item Number
fa: شماره آیتم

# templ:areasum:description
source: Description
fa: شرح

# templ:areasum:count
source: Count
fa: شمردن

# templ:areasum:width-height
source: Width and height
fa: عرض و ارتفاع

# templ:areasum:measured-area
source: Measured area
fa: سطح اندازه گیری شده

# templ:areasum:factor
source: Factor
fa: فاکتور

# templ:areasum:calculated-area
source: Calculated area
fa: مساحت محاسبه شده

# templ:areasum:plus-minus-area
source: +/- area columns
fa: +/- ستون های سطح

# templ:areasum:image-area-sum
source: Image area sum
fa: جمع سطح عکس

# templ:areasum:tablespec:default-name
source: Area sum table
fa: جدول مجموع مساحت

# templ:areasum:table-column-description:item
source: The image number. The number will only be filled into the row with the image title.
fa: شماره عکس. این شماره فقط در ردیف عنوان عکس پر می شود.

# templ:areasum:table-column-description:description
source: Descriptive name of the area. This is either the default name of the tag, or a manually entered name for this area.
fa: نام توصیفی سطح. این نام پیش فرض برچسب یا نام وارد شده دستی برای این قسمت است.

# templ:areasum:table-column-description:count
source: The count multiplier for this area.
fa: ضریب شمارش برای این سطح.

# templ:areasum:table-column-description:width-height
source: Width and height are two columns that are filled with the side lengths if the area is a rectangle. For other shapes, the columns stay empty. Enter the two column headers separated by a semicolon.
fa: عرض و ارتفاع دو ستونی هستند که اگر مساحت یک مستطیل باشد با طول های کناری پر می شوند. برای سایر اشکال ، ستون ها خالی می شوند. دو سرصفحه ستون را که با یک علامت ویرگول از هم جدا شده اند وارد کنید.

# templ:areasum:table-column-description:measured-area
source: The raw, measured area without the factor or count applied.
fa: سطح خام ، سطح اندازه گیری شده بدون فاکتور یا شمارش اعمال شده است.

# templ:areasum:table-column-description:factor
source: The area factor applied when calculating the final area sum.
fa: فاکتور سطح زمانی که محاسبه مبلغ نهایی سطح مورد استفاده قرار می گیرد.

# templ:areasum:table-column-description:calculated-area
source: Calculated area including the factor and count.
fa: مساحت محاسبه شده شامل فاکتور و تعداد.

# templ:areasum:table-column-description:plus-minus-area
source: Generates two columns: a column including all areas that are added to the sum, and a column including all areas that are subtracted from the total sum. Enter the two column headers separated by a semicolon.
fa: دو ستون ایجاد می کند: یک ستون شامل تمام سطوحی که به مجموع اضافه می شوند ، و یک ستون شامل تمام قسمت هایی که از جمع کل کم می شوند. دو سرصفحه ستون را که با یک علامت ویرگول از هم جدا شده اند وارد کنید.

# templ:partslist:class-display-name
source: Parts list template
fa: الگوی لیست قطعات

# templ:partslist:tablespec:default
source: Default table
fa: جدول پیش فرض

# templ:partslist:tablespec:new
source: New table
fa: جدول جدید

# templ:partslist:tag:comment
source: Comment
fa: توضیح

# templ:partslist:columnheader:item:image
source: Image
fa: عکس

# templ:partslist:columnheader:item:element
source: No.
fa: نه.

# templ:partslist:columnheader:item:image_and_element
source: No.
fa: نه.

# templ:partslist:columnheader:tagname
source: Item
fa: مورد

# templ:partslist:columnheader:comment
source: Comment
fa: توضیح

# templ:partslist:columnheader:count
source: Count
fa: شمردن

# templ:uiitem:duplicate:local
source: (local copy)
fa: (کپی محلی)

# templ:uiitem:duplicate:global
source: (from settings)
fa: (از تنظیمات)

# table-operation:none
source: None
fa: هیچ

# table-operation:sum
source: Sum
fa: مجموع

# table-operation:avg
source: Average
fa: میانگین

# table-operation:min
source: Min
fa: حداقل

# table-operation:max
source: Max
fa: حداکثر

# table-operation:median
source: Median
fa: متوسط

# table-operation:count
source: Count
fa: شمردن

# SyncAction:NOP
source: No action
fa: هیچ اقدام

# SyncAction:PULL_NEW
source: Download new
fa: دانلود جدید

# SyncAction:PULL_UPDATE
source: Download update
fa: دانلود به روزرسانی

# SyncAction:PUSH_NEW
source: Upload new
fa: آپلود جدید

# SyncAction:PUSH_UPDATE
source: Upload update
fa: آپلود به روزرسانی

# SyncAction:DELETE_LOCAL
source: Delete locally
fa: حذف به صورت محلی

# SyncAction:DELETE_REMOTE
source: Delete on server
fa: حذف از سرور

# license:source:android-in-app
source: In-app
fa: در برنامه

# license:source:android-nativepro
source: Native
fa: بومی

# license:business
source: Business
fa: تجارت

# entity-initialization:image-title:pdf-page-without-name
source: PDF import, page {page}
fa: وارد کردن PDF ، صفحه {page}

# editor:warning:element:value-is-locked
source: Value is locked. You have to unlock it first.
fa: مقدار قفل شده است شما باید ابتدا قفل آن را باز کنید.

# lock:editor
source: editor
fa: ویرایشگر

# lock:folder-content
source: list folder content
fa: لیست محتوای پوشه

# lock:FileBrowserContent
source: file browser
fa: مرورگر فایل

# lock:thumbnail-rendering
source: thumbnail rendering
fa: عکس بند انگشتی

# lock:rendering
source: image rendering
fa: پردازش عکس

# lock:create-image
source: creating image
fa: ایجاد عکس

# lock:import-image
source: importing image
fa: وارد کردن عکس

# lock:syncer
source: cloud synchronization
fa: همگام سازی ابری

# lock:image-syncer
source: image cloud upload
fa: آپلود ابری عکس

# lock:pro-migration
source: pro migration
fa: مهاجرت حرفه ای

# lock:delete-image
source: deleting image
fa: حذف کردن عکس

# lock:dialog-image-name
source: image renaming dialog
fa: گفتگوی تغییر نام عکس

# lock:copy-directory
source: copying directory
fa: کپی کردن دایرکتوری

# lock:set-library-root
source: setting image library root
fa: تنظیم ریشه کتابخانه عکس
