Repository: Mai101o/ImageMeter-translations
Catalog: core/*.po
Languages: fa

# error:InternalError
source: Internal error: {}.
fa: خطای داخلی: {}.

# error:ZLibCompressionError
source: ZLib error code: '{}'.
fa: کد خطای ZLib: '{}'.

# error:ZipError
source: ZIP error: {}
fa: خطای زیپ:

# error:ZIP_ReadError
source: Error reading ZIP file.
fa: خطا در خواندن فایل زیپ.

# error:NLohmann_JsonParseError
source: Parse error '{}'
fa: خطای تجزیه '{}'

# error:LibJPEG_Error
source: LibJPEG error: "{}".
fa: خطای LibJPE: "{}".

# error:Files_FileDoesNotExist
source: File does not exist: "{}".
fa: فایل وجود ندارد: "{}".

# error:Files_FileCannotBeOpened
source: Cannot open file "{}".
fa: فایل "{}" باز نمی شود.

# error:Files_CannotDeleteFile
source: Cannot delete file '{}'.
fa: فایل '{}' حذف نمی شود.

# error:Files_CannotReadFile
source: Cannot read file '{}'.
fa: فایل '{}' را نمی توان خواند.

# error:Files_CannotWriteFile
source: Cannot write file '{}'.
fa: نمی توان فایل '{}' را نوشت.

# error:Files_CannotRenameFile
source: Cannot rename file '{0}' to '{1}'.
fa: تغییر نام فایل '{0}' به '{1}' امکان پذیر نیست.

# error:Files_CannotCreateDirectory
source: Cannot create directory "{}".
fa: دایرکتوری "{}" ایجاد نمی شود.

# error:Files_DirectoryDoesNotExist
source: Directory '{}' does not exist.
fa: دایرکتوری '{}' وجود ندارد.

# error:Files_CannotRenameDirectory
source: Cannot rename folder '{0}' to '{1}'.
fa: نمی توان پوشۀ '{0}' را به '{1}' تغییرنام داد.

# error:Files_CannotDeleteDirectory
source: Cannot delete folder '{}'.
fa: نمی توان پوشۀ '{}' را پاک کرد.

# error:Files_CorruptedFileCompression
source: File compression error.
fa: خطای فشرده سازی فایل.

# error:Files_CannotReadDirectory
source: Cannot read directory '{}'.
fa: نمی تواند دایرکتوری '{}' را بخواند.

# error:Files_CannotCopyDirectory
source: Cannot copy directory '{}'.
fa: نمی توانید دایرکتوری '{}' را کپی کنید.

# error:Files_Errno
source: OS error: '{}'.
fa: خطا: '{}'.

# error:Files_CannotGenerateUniqueFilename
source: Cannot generate unique filename: '{}'.
fa: نام فایل منحصر به فرد ایجاد نمی شود: '{}'.

# error:ProjectFolder_CannotCreate
source: Cannot create folder '{}'.
fa: پوشه '{}' ایجاد نمی شود.

# error:ProjectFolder_CannotWriteIFD
source: Cannot write IFD file for folder '{}'.
fa: نمی توان فایل IFD را برای پوشه '{}' نوشت.

# error:ProjectFolder_CannotLoadFolder
source: Cannot load folder '{}'.
fa: پوشه '{}' بارگیری نمی شود.

# error:ProjectFolder_MultipleIFDFiles
source: More than one IFD file found.
fa: بیش از یک فایل IFD ییدا شده است.

# error:ProjectFolder_IFDParseError
source: IFD file parse error.
fa: خطای تجزیه فایل IFD.

# error:DataBundle_CannotLoadDataBundle
source: Cannot load image '{}'.
fa: عکس '{}' بارگیری نمی شود.

# error:DataBundle_CannotCreate
source: Cannot create new image '{}'.
fa: عکس جدید '{}' ایجاد نمی شود.

# error:DataBundle_CannotWriteIMM
source: Cannot write IMM file for image '{}'.
fa: نمی توان فایل IMM را برای عکس '{}' نوشت.

# error:DataBundle_CannotDelete
source: Cannot delete image '{}'.
fa: عکس '{}' حذف نمی شود.

# error:DataBundle_CannotRenameFolder
source: Cannot rename directory of image '{}'.
fa: تغییر نام دایرکتوری '{}' عکس امکان پذیر نیست.

# error:DataBundle_MultipleIMMFiles
source: More than one IMM file found.
fa: بیش از یک فایل IMM ییدا شده است.

# error:DataBundle_CannotReadIMMFile
source: Cannot read IMM file.
fa: فایل IMM قابل خواندن نیست.

# error:DataBundle_CannotGetContentArea
source: Unknown content area.
fa: سطح محتوای ناشناخته.

# error:DataBundle_IMMParseError
source: IMM file parse error ({}).
fa: خطای تجزیه فایل IMM ({}).

# error:Entity_CannotMove
source: Cannot move '{}' to new directory.
fa: نمی توان '{}' را به دایرکتوری جدید منتقل کرد.

# error:Entity_Numbering_InvalidNumber
source: Invalid number: '{}'.
fa: شماره نامعتبر: '{}'.

# error:DeleteLogic_CannotDelete
source: Cannot delete folder '{}'.
fa: پوشه '{}' حذف نمی شود.

# error:DeleteLogic_CannotMarkAsDeleted
source: Cannot mark folder '{}' as deleted.
fa: پوشه '{}' را نمی توان به عنوان پاک شده علامت گذاری کرد.

# error:IFD_ParseError
source: IFD file parse error.
fa: خطای تجزیه فایل IFD.

# error:CannotLockPath-readLock
source: Cannot read file '{}' because it is currently being modified.
fa: فایل '{}' را نمی توان خواند زیرا هم اکنون در حال اصلاح است.

# error:CannotLockPath-writeLock
source: Cannot modify file '{}' because it is currently in use.
fa: فایل '{}' قابل تغییر نیست زیرا هم اکنون در حال استفاده است.

# error:UnknownFileFormat
source: File '{}' has unknown format.
fa: فایل '{}' فرمت ناشناخته ای دارد.

# error:CannotCreateIMIFile
source: Cannot create IMI file '{}'.
fa: فایل IMI '{}' ایجاد نمی شود.

# error:ImageReader_ReaderError
source: Image reader error.
fa: خطای خواننده عکس

# error:ImageReader_CorruptedImage
source: Corrupted image file.
fa: فایل عکس خراب شده

# error:ImageReader_UnsupportedFormat
source: Unsupported image format.
fa: فرمت عکس پشتیبانی نشده است.

# error:CannotReadTexture
source: Cannot read texture '{}'.
fa: نمی تواند بافت '{}' را بخواند.

# error:OpenGL
source: OpenGL error: "{}".
fa: خطای OpenGL: "{}".

# error:CannotRenderImage
source: Cannot render image "{}".
fa: نمیتوانم عکس "{}" را رندر کنم.

# error:DataBundle_CannotOpen
source: Cannot open image "{}".
fa: عکس "{}" را باز نمی شود.

# error:EditCore_CannotLoadAuxiliary_Data
source: Cannot load auxiliary data.
fa: داده های کمکی بارگیری نمی شود.

# error:EditCore_CannotPurgeUnusedAuxiliaryFiles
source: Cannot delete unused auxiliary data files.
fa: نمی انید فایل های داده های کمکی استفاده نشده را حذف کنید.

# error:GText_CannotAddDetailImage
source: Cannot add the detail image "{}".
fa: نمی توان جزئیات عکس "{}" را اضافه کرد.

# error:GText_CannotAddAudioRecording
source: Cannot add audio recording "{}".
fa: ضبط صدا "{}" را نمی توان اضافه کرد.

# error:EditCore_CannotReadBackgroundImage
source: Cannot read photo.
fa: عکس را نمی تواند بخواند.

# error:ImageReader_CannotReadImage
source: Cannot read image file.
fa: فایل عکس را نمی توان خواند

# error:IMI_CannotOpen
source: Cannot open IMI file '{}'.
fa: فایل IMI '{}' باز نمی شود.

# error:IMF_CannotReadZip
source: Corrupted ZIP file "{}".
fa: فایل ZIP "{}" خراب شده است.

# error:IMF_CorruptedFile
source: Corrupted IMF file.
fa: فایل IMF خراب شده است.

# error:CannotGeneratePdf
source: Cannot generate PDF
fa: امکان تولید PDF وجود ندارد

# error:LibHaru
source: LibHARU error: "{}"
fa: خطای Libharu: "{}"

# error:ImageSettings_CannotLoad
source: Cannot load image settings.
fa: تنظیمات عکس بارگیری نمی شود.

# error:ImageSettings_CannotSave
source: Cannot save image settings.
fa: تنظیمات عکس ذخیره نمی شود.

# error:AppPreferences_CannotSetDataRootDirectory
source: Cannot set the data root directory.
fa: دایرکتوری ریشه داده را نمی توان تنظیم کرد.

# error:AppPreferences_CannotCreateDataRootDirectory
source: Cannot create the data root directory.
fa: دایرکتوری ریشه داده ایجاد نمی شود.

# error:AppPreferences_NoRootDefined
source: No data root directory defined.
fa: هیچ دایرکتوری ریشه داده ای تعریف نشده است.

# error:ImageLibrary_NoLibraryDirectoryDefined
source: No image library directory defined.
fa: هیچ دایرکتوری کتابخانه عکس تعریف نشده است.

# error:ImageLibrary_CannotPurge
source: Cannot purge deleted images.
fa: پاکسازی کردن عکس های پاک شده امکان پذیر نیست.

# error:Cloud_CannotLogin:unknown
source: Cannot sign in to your cloud server account.
fa: نمی توانید به حساب سرور ابری خود وارد شوید.

# error:Cloud_CannotLogin:unauthorized
source: Not authorized to sign in to your cloud server account.
fa: مجاز به ورود به حساب کاربری سرور ابری خود نیستید.

# error:Cloud_CannotLogin:incorrect_password
source: Wrong user name or password.
fa: نام کاربری یا رمز عبور اشتباه است.

# error:Cloud_CannotLogin:interactive_login_required
source: Interactive sign in to your cloud server account is required.
fa: ورود به سیستم تعاملی به حساب سرور ابری شما مورد نیاز است.

# error:Cloud_CannotLogin:cancelled_by_user
source: Sign in to your cloud server account has been cancelled.
fa: وارد به حساب کاربری سرور ابری شما لغو شده است.

# error:Cloud_CannotLogin:network_error
source: Network error while connecting to your cloud server account.
fa: خطای شبکه هنگام اتصال به حساب سرور ابری شما.

# error:Cloud_CannotLogin:server_timeout
source: Cloud server timeout.
fa: مهلت زمانی سرور ابری.

# error:Cloud_CannotLogin:cannot_access_base_folder
source: Cannot access data directory on cloud server.
fa: دسترسی به دایرکتوری داده ها در سرور ابری امکان پذیر نیست.

# error:Cloud_SyncError
source: Cannot sync with server.
fa: همگام سازی با سرور امکان پذیر نیست.

# error:Cloud_CannotLockServer
source: Cannot generate server lock file.
fa: نمی توان فایل قفل سرور را ایجاد کرد.

# error:Cloud_ServerError
source: Server error: {}
fa: خطای سرور: {}

# error:Cloud_FileLockedOnServer
source: File is locked on server. Please retry upload at a later time.
fa: فایل بر روی سرور قفل شده است. لطفاً بعداً دوباره آپلود کنید.

# error:Cloud_RemoteFileDoesNotExist
source: File '{}' does not exist on server
fa: فایل '{}' در سرور وجود ندارد

# error:Cloud_RemoteFolderDoesNotExist
source: Folder '{}' does not exist on server
fa: پوشه '{}' در سرور وجود ندارد

# error:Cloud_CannotCreateFolder
source: Cannot create folder '{}' on server
fa: پوشه '{}' در سرور ایجاد نمی شود

# error:Cloud_CannotUploadFile
source: Cannot upload file '{}' to server
fa: فایل '{}' در سرور آپلود نمی شود

# error:Cloud_CannotDownloadFile
source: Cannot download file '{}' from server
fa: دانلود فایل '{}' از سرور امکان پذیر نیست

# error:Cloud_CannotDownloadFolder
source: Cannot download folder '{}' from server
fa: پوشه '{}' از سرور دانلود نمی شود

# error:Cloud_CannotRenameFile
source: Cannot rename file '{}' on server
fa: تغییرنام فایل '{}' در سرور امکان پذیر نیست

# error:Cloud_CannotRenameFolder
source: Cannot rename folder '{}' on server
fa: تغییرنام پوشه '{}' در سرور امکان پذیر نیست

# error:Cloud_CannotDeleteFile
source: Cannot delete file '{}' from server
fa: حذف فایل'{}' از سرور امکان پذیر نیست

# error:Cloud_CannotDeleteFolder
source: Cannot delete folder '{}' from server
fa: پاک کردن پوشه '{}' از سرور امکان پذیر نیست

# error:Cloud_CannotListFolderContent
source: Cannot list content of server folder '{}'
fa: نمی توان محتوای پوشه سرور '{}' را لیست کرد

# error:Cloud_IsNotAFolder
source: File '{}' is not a folder.
fa: فایل '{}' در پوشه نیست.

# error:Cloud_CannotRemoveServerLock
source: Could not remove server lock file '{}'.
fa: فایل قفل سرور '{}' حذف نشد.

# error:Cloud_CannotResetServerCache
source: Could not remove server cache file '{}'.
fa: فایل کش سرور '{}' را نمی توان حذف کرد.

# error:Cloud_CannotResetSyncState
source: Could not reset sync state.
fa: وضعیت همگام سازی قابل تنظیم نیست.

# error:Android_ExternalDirectoryNotMounted
source: External directory is not mounted.
fa: دایرکتوری خارجی نصب نشده است.

# error:Android_NeedsStoragePermission
source: Access to directory '{}' needs the Storage permission.
fa: دسترسی به دایرکتوری '{}' نیاز به مجوز ذخیره سازی دارد.

# error:Android_Import_SecurityException
source: Security exception when accessing URI '{}'.
fa: استثناء امنیتی هنگام دسترسی به URL '{}'.

# error:Android_InsertImageIntoGallery
source: Cannot insert image into gallery ({}).
fa: نمی توان عکس را از گالری وارد کرد ({}).

# error:Android_CopyImageDataIntoGallery
source: Cannot copy image data into gallery (url='{}').
fa: نمی توان داده های عکس را در گالری کپی کرد (url='{}').

# error:Android_DeleteOldImageFromGallery
source: Cannot delete old image from gallery (url='{}').
fa: حذف عکس قدیمی از گالری امکان پذیر نیست (url='{}').

# unit:translated-name:inch
source: inch
fa: اینچ

# unit:translated-name:foot
source: foot
fa: فوت

# unit:translated-name:yard
source: yard
fa: یارد

# unit:translated-name:mile
source: mile
fa: مایل

# unit:translated-name:mil
source: mil
fa: مایل

# unit:translated-name:inch2
source: sq inch
fa: اینچ مربع

# unit:translated-name:foot2
source: sq foot
fa: فوت مربع

# unit:translated-name:yard2
source: sq yard
fa: یارد مربع

# unit:translated-name:mile2
source: sq mile
fa: مایل مربع

# unit:translated-name:ha
source: hectare
fa: هکتار

# unit:translated-name:mil2
source: square mil
fa: مایل مربع

# unit:translated-name:cmil
source: circular mil
fa: مایل دایره وار

# unit:translated-name:degrees
source: degrees
fa: درجه

# unit:translated-name:slope-percent
source: slope %
fa: شیب %

# unit:translated-name:radian
source: radians
fa: رادیان

# unit:translated-name:gradians
source: gradians
fa: گرادیان

# labeltype:any
source: Any
fa: هر چیزی

# labeltype:length
source: Length
fa: طول

# labeltype:area
source: Area
fa: سطح

# labeltype:angle
source: Angle
fa: زاویه

# labeltype:perimeter
source: Perimeter
fa: محیط

# labeltype:diameter
source: Diameter
fa: قطر

# labeltype:radius
source: Radius
fa: شعاع

# labeltype:width
source: Width
fa: عرض

# labeltype:height
source: Height
fa: ارتفاع

# labeltype:rectangle-side(rectangle)
source: Rectangle
fa: مستطیل

# dimformat:options-ui:min-imperial-fraction:title:long
source: Smallest fraction of an inch
fa: کوچکترین کسر از یک اینچ

# dimformat:options-ui:min-imperial-fraction:no-fraction
source: No fractions
fa: غیرکسری

# dimformat:options-ui:imperial-uses-text-units:title
source: Textual imperial units
fa: واحدهای امپریال متنی

# dimformat:options-ui:imperial-uses-text-units:no
source: Show as '/"
fa: واحدهای امپریال نمایش داده می شوند به صورت '/"

# dimformat:options-ui:imperial-uses-text-units:yes
source: Show as ft/in
fa: واحدهای امپریال به صورت ft/in نمایش داده خواهند شد

# dimformat:options-ui:ambiguous-numbers:title
source: Ambiguous numbers
fa: افزودن ابهامزدایی نقطه

# dimformat:options-ui:ambiguous-numbers:no
source: Keep
fa: خیر

# dimformat:options-ui:ambiguous-numbers:add-dot
source: Add dot if necessary
fa: بله، در صورت لزوم

# dimformat:options-ui:show-units:title
source: Show units
fa: نمایش واحدها

# dimformat:options-ui:show-units:no
source: Show only the value, omit the unit
fa: فقط نمایش مقدار ، حذف واحد

# dimformat:options-ui:show-units:yes
source: Yes, show value and unit
fa: بله، نمایش مقدار و واحد

# dimformat:options-ui:reduce-fractions:title
source: Reduce fractions
fa: ساده کردن کسرها

# dimformat:options-ui:reduce-fractions:no
source: Keep (4/8 stays 4/8)
fa: کسرها ساده نخواهند شد (4/8 باقی می ماند 4/8)

# dimformat:options-ui:reduce-fractions:yes
source: Reduce (4/8 becomes 1/2)
fa: کسرها ساده خواهند شد (4/8 می شود 1/2)

# month-names-short-1
source: Jan
fa: ژانویه

# month-names-short-2
source: Feb
fa: فوریه

# month-names-short-3
source: Mar
fa: مارس

# month-names-short-4
source: Apr
fa: آوریل

# month-names-short-5
source: May
fa: می

# month-names-short-6
source: Jun
fa: ژوئن

# month-names-short-7
source: Jul
fa: ژوئیه

# month-names-short-8
source: Aug
fa: اوت

# month-names-short-9
source: Sep
fa: سپتامبر

# month-names-short-10
source: Oct
fa: اکتبر

# month-names-short-11
source: Nov
fa: نوامبر

# month-names-short-12
source: Dec
fa: دسامبر

# month-names-long-1
source: January
fa: ژانویه

# month-names-long-2
source: February
fa: فوریه

# month-names-long-3
source: March
fa: مارس

# month-names-long-4
source: April
fa: آوریل

# month-names-long-5
source: May
fa: می

# month-names-long-6
source: June
fa: ژوئن

# month-names-long-7
source: July
fa: ژوئیه

# month-names-long-8
source: August
fa: اوت

# month-names-long-9
source: September
fa: سپتامبر

# month-names-long-10
source: October
fa: اکتبر

# month-names-long-11
source: November
fa: نوامبر

# month-names-long-12
source: December
fa: دسامبر

# eight-directions:top-left
source: Top left
fa: بالا سمت چپ

# eight-directions:top
source: Top
fa: بالا

# eight-directions:top-right
source: Top right
fa: بالا سمت راست

# eight-directions:right
source: Right
fa: راست

# eight-directions:bottom-right
source: Bottom right
fa: پایین سمت راست

# eight-directions:bottom
source: Bottom
fa: پایین

# eight-directions:bottom-left
source: Bottom left
fa: پایین سمت چپ

# eight-directions:left
source: Left
fa: چپ

# text-h-alignment:left
source: Left
fa: چپ

# text-h-alignment:center
source: Center
fa: وسط

# text-h-alignment:right
source: Right
fa: راست

# filename-copy-tag
source: copy
fa: کپی

# pdf-export:table-of-contents
source: Table of contents
fa: فهرست مطالب

# pdf-export:root-folder-title
source: ImageMeter export
fa: ImageMeter صادر کردن

# editor:attach:error_no_reference_to_attach_to
source: There is no reference in the image! You need to draw a reference in order to do automatic computations.
fa: هیچ مرجعی در عکس وجود ندارد! شما نیاز به رسم یک مرجع جهت محاسبات اتوماتیک دارید.

# editor:attach:error_no_element_to_attach_to_reference
source: There is no measure that could be computed.
fa: هیچ مرجعی برای محاسبه وجود ندارد.

# editor:attach:info_element_has_been_attached_to_single_reference
source: Measure is computed based on the reference you provided.
fa: اندازه گیری بر اساس مرجعی که فراهم کرده اید انجام می شود.

# editor:attach:hint_howto_attach_to_reference
source: Click on the measure you want to compute based on the selected reference.
fa: بر روی اندازه گیری ای که می خواهید بر اساس مرجع انتخاب شده محاسبه گردد کلیک کنید.

# editor:attach:hint_howto_attach_measure
source: Click on the reference based on which you want to calculate the selected measure.
fa: بر روی مرجع بر اساس آنچه که می خواهید اندازه گیری انتخابی را محاسبه نمایید کلیک کنید.

# editor:styling:line-caps
source: Line style
fa: سبک خط

# editor:styling:line-caps-size
source: Line cap size
fa: اندازۀ کلاهک خط

# editor:styling:line-width
source: Line width
fa: پهنای خط

# editor:styling:line-pattern
source: Line pattern
fa: الگوی خط

# editor:styling:font-size
source: Font size
fa: اندازۀ فونت

# editor:styling:fill-color
source: Fill color
fa: پر کردن رنگ

# editor:styling:text-color
source: Text color
fa: رنگ متن

# editor:styling:text-background-color
source: Background color
fa: رنگ پس زمینه

# editor:styling:set-as-default
source: Set as default
fa: قرار دادن به صورت پیش فرض

# editor:styling:label:apply-to
source: Apply to …
fa: اعمال برای …

# editor:styling:label:apply-to:both-sides
source: Both sides
fa: هر دو طرف

# editor:styling:label:apply-to:all-edges
source: All edges
fa: تمام لبه ها

# editor:styling:label:apply-to:all-lengths
source: All lengths
fa: تمام طول ها

# editor:styling:label:apply-to:whole-element
source: Whole element
fa: کل عنصر

# editor:styling:label:apply-to:whole-image
source: Whole image
fa: عکس کامل

# editor:styling:label:save-as-default:selection-title
source: Use style as default for …
fa: استفاده از سبک به طور پیش فرض برای...

# editor:styling:label:save-as-default:only-this-label
source: Only this label
fa: فقط این برچسب

# editor:styling:label:save-as-default:this-drawing-tool
source: This drawing tool
fa: این ابزار رسم

# editor:styling:label:save-as-default:all-drawing-tools
source: All drawing tools
fa: تمام ابزارهای رسم

# editor:styling:label-display-mode
source: Text position
fa: موقعیت متن

# editor:styling:label-display-mode:above-line
source: Above line
fa: خط بالا

# editor:styling:label-display-mode:within-line
source: Within line
fa: درون خط

# editor:styling:label-display-mode:horizontal
source: Horizontal
fa: افقی

# editor:styling:area:show-area-label
source: Show area
fa: نمایش متن

# editor:styling:area:show-perimeter-label
source: Show perimeter
fa: نمایش پیرامون

# editor:styling:area:show-edge-labels
source: Show edge lengths
fa: نمایش طول لبه ها

# editor:styling:area:show-edge-labels:none
source: None
fa: هیچ

# editor:styling:area:show-edge-labels:custom
source: Custom
fa: سفارشی

# editor:styling:area:show-edge-labels:all
source: All
fa: همه

# editor:styling:area:edge-labels-font-size
source: Edges font size
fa: اندازه فونت لبه ها

# editor:styling:circle:show-radius-label
source: Show radius
fa: نمایش شعاع

# editor:styling:circle:show-diameter-label
source: Show diameter
fa: نمایش قطر

# editor:styling:circle:show-circumference-label
source: Show circumference
fa: نمایش محیط دایره

# editor:styling:circle:show-angle-label
source: Show angle
fa: نمایش زاویه

# editor:styling:circle:show-area-label
source: Show area
fa: نمایش ناحیه

# editor:styling:dimstring:show-intersection-marks
source: Show intersection marks
fa: نمایش علائم تقاطع

# editor:styling:flatref:subdivisions
source: Subdivisions
fa: زیرمجموعه ها

# editor:styling:flatref:subdivisions:none
source: None
fa: هیچ

# editor:styling:flatref:display-labels
source: Display labels
fa: نمایش برچسب ها

# editor:styling:flatref:display-labels:none
source: None
fa: هیچ

# editor:styling:flatref:display-labels:only-total-length
source: Only total length
fa: فقط طول کل

# editor:styling:flatref:display-labels:all-labels
source: All labels
fa: تمام برچسب ها

# editor:styling:flatref:display-labels:every-second-label
source: Every second label
fa: هر برچسب دوم

# editor:styling:flatref:label-position
source: Label position
fa: موقعیت برچسب

# editor:styling:flatref:label-position:above
source: Above
fa: در بالا

# editor:styling:flatref:label-position:below
source: Below
fa: زیر

# editor:styling:flatref:label-position:alternating-last-above
source: Alternating, last one above
fa: متناوب ، یکی از آخرین بالا

# editor:styling:flatref:label-position:alternating-last-below
source: Alternating, last one below
fa: متناوب ، یکی از آخرین زیر

# editor:styling:measurement-point:show-label
source: Show text
fa: نمایش متن

# editor:styling:measurement-point:label-position
source: Label position
fa: موقعیت برچسب

# editor:styling:measurement-point:marker-symbol
source: Marker
fa: نشانگر

# editor:styling:measurement-point:marker-symbol:encircled-cross
source: Encircled cross
fa: صلیب محاصره شده

# editor:styling:measurement-point:marker-symbol:upright-cross
source: Upright cross
fa: صلیب راست بالا

# editor:styling:measurement-point:marker-symbol:diagonal-cross
source: Diagonal cross
fa: صلیب مورب

# editor:styling:measurement-point:marker-symbol:dot
source: Dot
fa: نقطه

# editor:styling:measurement-point:marker-symbol:elevation-top
source: Elevation top
fa: بالای ارتفاع

# editor:styling:measurement-point:marker-symbol:elevation-bottom
source: Elevation bottom
fa: پایین ارتفاع

# editor:styling:measurement-point:marker-symbol-size
source: Marker size
fa: اندازه نشانگر

# editor:styling:perspective-line:always-show-grid
source: Always show grid
fa: نمایش همیشگی شبکه

# editor:styling:rectangle:show-side-lengths
source: Show side lengths
fa: نمایش طول جانبی

# editor:styling:rectangle:show-area
source: Show area
fa: نمایش منطقه

# editor:styling:rectangle:show-perimeter
source: Show perimeter
fa: نمایش محیط

# editor:styling:rect-ref:text-position
source: Text position
fa: موقعیت متن

# editor:styling:rect-ref:text-position:above-line
source: Above line
fa: در بالا خط

# editor:styling:rect-ref:text-position:within-line
source: Within line
fa: در داخل خط

# editor:styling:rect-ref:show-area
source: Show area
fa: نمایش ناحیه

# editor:styling:rect-ref:always-show-grid
source: Always show grid
fa: نمایش همیشگی شبکه

# editor:styling:rect-ref:grid-subdivions:both
source: Grid subdivisions
fa: مقسم شبکه

# editor:styling:rect-ref:grid-subdivions:h
source: Grid subdivisions (H)
fa: مقسم شبکه (H)

# editor:styling:rect-ref:grid-subdivions:v
source: Grid subdivisions (V)
fa: مقسم شبکه (V)

# editor:styling:textbox:text-h-alignment
source: Text alignment
fa: محیط متن

# editor:styling:textbox:show-text-outline
source: Text outline
fa: یادداشت متن

# editor:styling:textbox:show-arrows
source: Show arrows
fa: نمایش پیکان

# editor:styling:textbox:show-box-border
source: Show box border
fa: نمایش حاشیه

# editor:styling:textbox:box-background-color
source: Background color
fa: رنگ پس زمینه

# image-settings:image:saturation
source: Saturation
fa: اشباع

# image-settings:image:brightness
source: Brightness
fa: روشنایی

# image-settings:image:contrast
source: Contrast
fa: تضاد

# image-settings:image:color-preset:original
source: Reset
fa: باز نشاندن
